src/InformationRegisters/AvataxDetails.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>AvataxDetails</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>TimeStamp</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TransactionID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TaxDetails</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AvataxStatus</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AvataxDocCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ObjectRef</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/AvalaraTransactions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>AvalaraTransactions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RequestParameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ResultBody</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ResultCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Messages</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AvataxTransactionID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ErrorMessage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TimeSpent</Name>
					<Comment>Time it took to perform the request in ms</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ObjectRef</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Comment>Date in UTF</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TransactionID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RequestType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AvalaraRequestTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/AvalaraRequestTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>AvalaraRequestTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ConnectionTest</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AddressValidation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TaxCalculation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancelTax</Name>
					<Comment>Voiding or Deleting documents at AvaTax</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/AvataxDetails/Forms/AvataxDetails/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ObjectRef = Parameters.ObjectRef;
	If Not ValueIsFilled(ObjectRef) Then
		Cancel = True;
		return;
	EndIf;
	Request = New Query("SELECT
	                    |	TaxDetailsTable.TimeStamp,
	                    |	TaxDetailsTable.TaxDetails,
	                    |	TaxDetailsTable.Status,
	                    |	AvalaraTransactions.RequestParameters
	                    |FROM
	                    |	(SELECT
	                    |		AvataxDetails.TimeStamp AS TimeStamp,
	                    |		AvataxDetails.TaxDetails AS TaxDetails,
	                    |		AvataxDetails.Status AS Status,
	                    |		AvataxDetails.TransactionID AS TransactionID
	                    |	FROM
	                    |		InformationRegister.AvataxDetails AS AvataxDetails
	                    |	WHERE
	                    |		AvataxDetails.ObjectRef = &ObjectRef) AS TaxDetailsTable
	                    |		LEFT JOIN InformationRegister.AvalaraTransactions AS AvalaraTransactions
	                    |		ON TaxDetailsTable.TransactionID = AvalaraTransactions.TransactionID
	                    |			AND (AvalaraTransactions.RequestType = VALUE(Enum.AvalaraRequestTypes.TaxCalculation))");
	Request.SetParameter("ObjectRef", Parameters.ObjectRef);
	Res = Request.Execute();
	If Res.IsEmpty() Then
		Cancel = True;
		return;
	EndIf;
	Sel = Res.Select();
	Sel.Next();
	TimeStamp = Sel.TimeStamp;
	Status = Sel.Status;
	LastTaxDetails = Sel.TaxDetails.Get();
	LastTaxLines = LastTaxDetails.TaxLines;
	RequestParameters = Sel.RequestParameters;
	LastLineParameters = Undefined;
	If ValueIsFilled(RequestParameters) Then
		RPValue = RequestParameters.Get();
		If RPValue.Property("RequestParameters") Then
			LastLineParameters = RPValue.RequestParameters.Lines;
		EndIf;
	EndIf;
	For Each LastTaxLine In LastTaxLines Do
		NewTaxLine = TaxLines.Add();
		FillPropertyValues(NewTaxLine, LastTaxLine);
		If Find(LastTaxLine.LineNo, "Shipping") Then
			NewTaxLine.ProductDescription = "Shipping";
			NewTaxLine.DocumentLineNo = LastTaxLines.Count();
		Else
			NewTaxLine.DocumentLineNo = LastTaxLine.LineNo;
		EndIf;
		NewTaxLine.Rate = NewTaxLine.Rate * 100;
		For Each LastTaxDetail In LastTaxLine.TaxDetails Do
			NewTaxDetail = TaxDetails.Add();
			FillPropertyValues(NewTaxDetail, LastTaxDetail);
			NewTaxDetail.LineNo = LastTaxLine.LineNo;
			NewTaxDetail.Rate 	= NewTaxDetail.Rate * 100;
		EndDo;
		//Filling Product and ProductDescription
		//These fields are in the request parameters (sent to AvaTax)
		If LastLineParameters <> Undefined Then
			LineParametersFound = Undefined;
			For Each LineParam In LastLineParameters Do
				If LineParam.LineNo = LastTaxLine.LineNo  Then
					LineParametersFound = LineParam;
					Break;
				EndIf;
			EndDo;
			If LineParametersFound <> Undefined Then
				NewTaxLine.Product = LineParametersFound.ItemCode;
				NewTaxLine.ProductDescription = LineParametersFound.Description;
				If Find(NewTaxLine.Product, "Shipping") Then
					NewTaxLine.Product = "Shipping";
				EndIf;
			EndIf;
		EndIf;
	EndDo;
	TaxLines.Sort("DocumentLineNo");
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	ThisForm.Title = "Tax detail for the " + String(ObjectRef) + ". Calculated on " + Format(ToLocalTime(TimeStamp), "DLF=");
EndProcedure

&AtClient
Procedure TaxLinesOnActivateRow(Item)
	If Items.TaxLines.CurrentData <> Undefined Then
		Items.TaxDetails.RowFilter = New FixedStructure("LineNo", Items.TaxLines.CurrentData.LineNo);
	EndIf;
EndProcedure
